# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv5 object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/yolov5

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# 0-P1/2
# 1-P2/4
# 2-P3/8
# 3-P4/16
# 4-P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, fasternet_t0, []],  # 4
   [-1, 1, SPPF, [1024, 5]], # 5
  ]

# YOLOv5 v6.0 head
head:
  [[[1,2,3,5], 1, SimFusion_4in, []], # 6
   [-1, 1, IFM, [[64, 32]]], # 7
   
   [5, 1, Conv, [512, 1, 1]], # 8
   [[2, 3, -1], 1, SimFusion_3in, [512]], # 9
   [[-1, 7], 1, InjectionMultiSum_Auto_pool, [512, [64, 32], 0]], # 10
   [-1, 3, C3, [512, False]], # 11

   [3, 1, Conv, [256, 1, 1]], # 12
   [[1, 2, -1], 1, SimFusion_3in, [256]], # 13
   [[-1, 7], 1, InjectionMultiSum_Auto_pool, [256, [64, 32], 1]], # 14
   [-1, 3, C3, [256, False]], # 15

   [[15, 11, 5], 1, PyramidPoolAgg, [352, 2]], # 16
   [-1, 1, TopBasicLayer, [352, [64, 128]]], # 17

   [[15, 12], 1, AdvPoolFusion, []], # 18
   [[-1, 17], 1, InjectionMultiSum_Auto_pool, [256, [64, 128], 0]], # 19
   [-1, 3, C3, [512, False]], # 20

   [[-1, 8], 1, AdvPoolFusion, []], # 21
   [[-1, 17], 1, InjectionMultiSum_Auto_pool, [512, [64, 128], 1]], # 22
   [-1, 3, C3, [1024, False]], # 23

   [[2,3,4], 1, ScalSeq, [256]], # 24 args[inchane]
   [[15, -1], 1, asf_attention_model, []], # 25

   [[25, 20, 23], 1, Detect, [nc, anchors]] # 24
  ]
